{
    "mipEra": "cmip6", 
    "institute": "ncar", 
    "seedingSource": null, 
    "sourceID": "cesm2", 
    "topic": "land", 
    "content": {
        "cmip6.land.key_properties.name": {
            "values": [
                "Community Land Model version 5 (CLM5)"
            ]
        }, 
        "cmip6.land.key_properties.keywords": {
            "values": [
                "water cycle, energy balance, vegetation, hydrology, snow, land cover and land use change, carbon and nitrogen cycling, crop model, rivers, urban, permafrost carbon modeling"
            ]
        }, 
        "cmip6.land.key_properties.overview": {
            "values": [
                "The Community Land Model version 5 (CLM5) is the land model for the Community Earth System Model version 2 (CESM2).  Documentation including model diagnostics, references, technical description is available here: http://www.cesm.ucar.edu/models/cesm2/land/.   CLM5 is documented in Lawrence et al. (2019) and references within.  A full Technical Description of the model is available here: https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/index.html\n\nThe model formalizes and quantifies concepts of ecological climatology. Ecological climatology is an interdisciplinary framework to understand how natural and human changes in vegetation affect climate. It examines the physical, chemical, and biological processes by which terrestrial ecosystems affect and are affected by climate across a variety of spatial and temporal scales. The central theme is that terrestrial ecosystems, through their cycling of energy, water, chemical elements, and trace gases, are important determinants of climate. The land surface is a critical interface through which climate change impacts humans and ecosystems and through which humans and ecosystems can effect global environmental change.\n\nThe model represents many aspects of the land surface including surface heterogeneity and consists of components or submodels related to land biogeophysics, the hydrologic cycle, biogeochemistry, human dimensions, and ecosystem dynamics. Specific processes that are represented are listed in next box.\n\n\n                        \n                        \n                        \n                  \n"
            ]
        }, 
        "cmip6.land.key_properties.description": {
            "values": [
                "Vegetation composition, structure, and phenology; Prognostic absorption, reflection, and transmittance of solar radiation; Absorption and emission of longwave radiation; Momentum, sensible heat (ground and canopy), and latent heat (ground evaporation, canopy evaporation, transpiration) fluxes; Heat transfer in soil and snow including phase change; Canopy hydrology (interception, throughfall, and drip); Snow hydrology (snow accumulation and melt, compaction, water transfer between snow layers); Soil hydrology (surface runoff, infiltration, redistribution of water within the column, sub-surface drainage, groundwater, no explicit lateral flow); Plant hydrodynamics; Stomatal physiology and photosynthesis; Lake temperatures and fluxes; Dust deposition and emissions; Routing of runoff from rivers to ocean; Volatile organic compounds emissions; Urban energy balance and climate; Carbon-nitrogen cycling and dynamics; Dynamic landcover change; Land management including crops and crop management and wood harvest; No dynamic vegetation biogeography."
            ]
        }, 
        "cmip6.land.key_properties.tiling": {
            "values": [
                "Spatial land surface heterogeneity in CLM is represented as a nested subgrid hierarchy in which grid cells are composed of multiple land units, snow/soil columns, and Plant Functional Types (PFTs). Each grid cell can have a different number of land units, each land unit can have a different number of columns, and each column can have multiple PFTs. The first subgrid level, the land unit, is intended to capture the broadest spatial patterns of subgrid heterogeneity. The current land units are glacier, lake, urban, vegetated, and crop (when the crop model option is turned on). The land unit level can be used to further delineate these patterns. For example, the urban land unit is divided into density classes representing the tall building district, high density, and medium density urban areas.  The second subgrid level, the column, is intended to capture potential variability in the soil and snow state variables within a single land unit. For example, the vegetated land unit could contain several columns with independently evolving vertical profiles of soil water and temperature. Similarly, the managed vegetation land unit can be divided into two columns, irrigated and non-irrigated.  The central characteristic of the column subgrid level is that this is where the state variables for water and energy in the soil and snow are defined, as well as the fluxes of these components within the soil and snow. Regardless of the number and type of PFTs occupying space on the column, the column physics operates with a single set of upper boundary fluxes, as well as a single set of transpiration fluxes from multiple soil levels. These boundary fluxes are weighted averages over all PFTs. Currently, for lake and vegetated land units, a single column is assigned to each land unit. The crop land unit is split into irrigated and unirrigated columns with a single crop occupying each column. The urban land units have five columns (roof, sunlit walls and shaded walls, and pervious and impervious canyon floor). The glacier land unit is separated into up to 10 elevation classes. The land/sea mask is defined by the CESM ocean model.  Except for glacier land units, each land grid cell has just one elevation, which is defined by the atmosphere model."
            ]
        }, 
        "cmip6.land.key_properties.conservation_properties.energy": {
            "values": [
                "Global land energy is approximately conserved in the coupled model.  Net land energy imbalance in PiControl is < 0.04 W/m2.   At grid cell level on land, surface energy balance errors are < 1.e-5 W/m2 for each timestep. Energy is conserved through land cover transitions.  Known energy leaks include lack of tracking of stream temperature."
            ]
        }, 
        "cmip6.land.key_properties.conservation_properties.water": {
            "values": [
                "Global land water is approximately conserved in the coupled model.  The diagnosed net land water imbalance in PiControl is < 0.02 kg/m2/yr. At grid cell level on land, surface water balance errors for each time step are < 1.e-12 kg/m2/s. Water is conserved through land cover transitions.  "
            ]
        }, 
        "cmip6.land.key_properties.conservation_properties.carbon": {
            "values": [
                "Carbon error checks at each timestep ensure carbon balance errors < 0.002 gC/m2/yr.  Carbon is conserved through land cover transitions."
            ]
        }, 
        "cmip6.land.key_properties.timestepping_framework.timestep_dependent_on_atmosphere": {
            "values": [
                true
            ]
        }, 
        "cmip6.land.key_properties.timestepping_framework.time_step": {
            "values": [
                3600
            ]
        }, 
        "cmip6.land.key_properties.timestepping_framework.timestepping_method": {
            "values": [
                "Timestep is 30 mins. "
            ]
        }, 
        "cmip6.land.key_properties.software_properties.repository": {
            "values": [
                "https://github.com/ESCOMP/ctsm/tree/release-clm5.0.15"
            ]
        }, 
        "cmip6.land.key_properties.software_properties.code_version": {
            "values": [
                "CLM5"
            ]
        }, 
        "cmip6.land.key_properties.software_properties.code_languages": {
            "values": [
                "Fortran"
            ]
        }, 
        "cmip6.land.key_properties.tuning_applied.description": {
            "values": [
                "See discussion in Lawrence et al. (2019, Section 2.3.11) and Fisher et al. (2019).  Tuning in land-only for key quantities such as Leaf Area Index and GPP.  Relatively even weight given to 'climate performance' versus process-oriented.  Some biases could not be resolved through parameter tuning.  Challenges with respect to specific PFT survivability rates were encountered, especially in pre-industrial conditions.  See Lawrence et al. (2019) for more discussion."
            ]
        }, 
        "cmip6.land.grid.name": {
            "values": [
                "Cartesian latitude longitude "
            ]
        }, 
        "cmip6.land.grid.overview": {
            "values": [
                "The atmosphere model grid is a rectilinear cartesian grid in latitude longitude"
            ]
        }, 
        "cmip6.land.grid.horizontal.description": {
            "values": [
                "The horizontal land grid is global and is the same as the atmosphere grid.  Each grid cell may have a fraction of land ranging from 0 to 1 (the remainder being ocean). The land/ocean mask is defined by the CESM ocean model."
            ]
        }, 
        "cmip6.land.grid.horizontal.matches_atmosphere_grid": {
            "values": [
                true
            ]
        }, 
        "cmip6.land.grid.vertical.description": {
            "values": [
                "The soil column can be discretized into an arbitrary number of layers. The default vertical discretization uses 25 layers, of which 20 are hydrologically and biogeochemically active. The deepest 5 layers represent bedrock.\nhttps://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Ecosystem/CLM50_Tech_Note_Ecosystem.html#vertical-discretization\nThe hydrologically and biogeochemically active portion of the soil column can be restricted to a thickness less than that of the maximum soil depth. By providing a depth-to-bedrock dataset, which varies spatially, the number of layers used in the hydrologic and biogeochemical calculations is specified (5-20 layers).\nhttps://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Ecosystem/CLM50_Tech_Note_Ecosystem.html#depth-to-bedrock\n\n"
            ]
        }, 
        "cmip6.land.grid.vertical.total_depth": {
            "values": [
                50
            ]
        }, 
        "cmip6.land.snow.overview": {
            "values": [
                "The snowpack can have up to twelve layers. \nhttps://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Snow_Hydrology/CLM50_Tech_Note_Snow_Hydrology.html\nSnow processes modeled include vegetation burial by snow (https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Ecosystem/CLM50_Tech_Note_Ecosystem.html#phenology-and-vegetation-burial-by-snow), snow intercepted by vegetation (both liquid and solid phases, and unloading events due to wind or above-freezing temperatures) (https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Hydrology/CLM50_Tech_Note_Hydrology.html#canopy-water), fraction of ground covered by snow (https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Snow_Hydrology/CLM50_Tech_Note_Snow_Hydrology.html#snow-covered-area-fraction), mass of ice and liquid water in snow layers (https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Snow_Hydrology/CLM50_Tech_Note_Snow_Hydrology.html#ice-content, https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Snow_Hydrology/CLM50_Tech_Note_Snow_Hydrology.html#water-content), and snow compaction due to destructive metamorphism, overburden pressure, melt, and drifting snow (https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Snow_Hydrology/CLM50_Tech_Note_Snow_Hydrology.html#snow-compaction).  Snow albedo and solar absorption within each snow layer are simulated with the Snow, Ice, and Aerosol Radiative Model (SNICAR), which accounts for the effects of black and organic carbon and mineral dust particles within snow (https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Surface_Albedos/CLM50_Tech_Note_Surface_Albedos.html#ground-albedos) and includes meltwater flushing (https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Snow_Hydrology/CLM50_Tech_Note_Snow_Hydrology.html#black-and-organic-carbon-and-mineral-dust-within-snow)."
            ]
        }, 
        "cmip6.land.snow.tiling": {
            "values": [
                "Snow-covered and snow-free portions of vegetated and crop land units, and snow-covered and snow-free portions of glacier land units are separately simulated."
            ]
        }, 
        "cmip6.land.snow.number_of_snow_layers": {
            "values": [
                12
            ]
        }, 
        "cmip6.land.snow.density": {
            "values": [
                "Prognostic"
            ]
        }, 
        "cmip6.land.snow.water_equivalent": {
            "values": [
                "Prognostic"
            ]
        }, 
        "cmip6.land.snow.heat_content": {
            "values": [
                "Prognostic"
            ]
        }, 
        "cmip6.land.snow.temperature": {
            "values": [
                "Prognostic"
            ]
        }, 
        "cmip6.land.snow.liquid_water_content": {
            "values": [
                "Prognostic"
            ]
        }, 
        "cmip6.land.snow.snow_cover_fractions": {
            "values": [
                "Ground snow fraction", 
                "Vegetation snow fraction"
            ]
        }, 
        "cmip6.land.snow.processes": {
            "values": [
                "Snow interception", 
                "Snow melting", 
                "Snow freezing", 
                "Blowing snow"
            ]
        }, 
        "cmip6.land.snow.prognostic_variables": {
            "values": [
                "Mass of water, mass of ice, layer thickness, temperature, canopy snow water equivalent, hydrophilic black carbon, hydrophobic black carbon, hydrophilic organic carbon, hydrophobic organic carbon, four species of mineral dust.\nhttps://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Snow_Hydrology/CLM50_Tech_Note_Snow_Hydrology.html#"
            ]
        }, 
        "cmip6.land.snow.snow_albedo.type": {
            "values": [
                "Prognostic"
            ]
        }, 
        "cmip6.land.snow.snow_albedo.functions": {
            "values": [
                "Snow density", 
                "Snow age", 
                "Snow grain type", 
                "Aerosol deposition"
            ]
        }, 
        "cmip6.land.carbon_cycle.overview": {
            "values": [
                "CLM includes a prognostic treatment of the terrestrial carbon and nitrogen cycles including natural vegetation, crops, and soil biogeochemistry. The model is fully prognostic with respect to all carbon and nitrogen state variables in the vegetation, litter, and soil organic matter. The original carbon and nitrogen cycle model was based on Biome-BGC but it has diverged substantially from that model.  The seasonal timing of new vegetation growth and litterfall is also prognostic, responding to soil and air temperature, soil water availability, daylength, and crop management practices in varying degrees depending on a specified phenology type or management for each PFT. The prognostic LAI, SAI, tissue stoichiometry, and vegetation heights are utilized by the biophysical model that couples carbon, water, and energy cycles.  CLM includes a fully prognostic representation of the fluxes, storage,\nand isotopic discrimination of the carbon isotopes 13C and 14C.  Details on the carbon model are provided in Sections 16 through 27 of the CLM Technical Description: https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/CN_Pools/CLM50_Tech_Note_CN_Pools.html"
            ]
        }, 
        "cmip6.land.carbon_cycle.tiling": {
            "values": [
                "On natural vegetation landunit, all PFTs compete for water and nutrients from same soil column.  Soil C and litter C is tracked within this soil column.  Vegetation C tracked for each PFT. On crop landunit, each crop type (irrigated and rainfed) has its own soil column and therefore its own soil C and N state."
            ]
        }, 
        "cmip6.land.carbon_cycle.time_step": {
            "values": [
                3600
            ]
        }, 
        "cmip6.land.carbon_cycle.anthropogenic_carbon": {
            "values": [
                "Decay time"
            ]
        }, 
        "cmip6.land.carbon_cycle.prognostic_variables": {
            "values": [
                "Vegetation: Leaf Area Index; leaf, live stem, dead stem, live coarse root, dead coarse root, fine root, crop grain (each of these pools has two corresponding storage pools representing short-term and long-term storage of non-structural carbohydrates), growth respiration reserve, excess maintenance respiration, product (100 year, 10 year, 1 year), and crop seed; Soil and litter: coarse woody debris, 3 litter, and 3 soil pools as well as fluxes to and from each of these pools to each other.  GPP, NPP, and all respiration terms."
            ]
        }, 
        "cmip6.land.carbon_cycle.vegetation.number_of_carbon_pools": {
            "values": [
                23
            ]
        }, 
        "cmip6.land.carbon_cycle.vegetation.carbon_pools": {
            "values": [
                "Vegetation: leaf, live stem, dead stem, live coarse root, dead coarse \nroot, fine root, crop grain (each of these pools has two corresponding \nstorage pools representing short-term and long-term storage of \nnon-structural carbohydrates), growth respiration reserve, excess \nmaintenance respiration, product (100 year, 10 year, 1 year), and crop \nseed pools."
            ]
        }, 
        "cmip6.land.carbon_cycle.vegetation.forest_stand_dynamics": {
            "values": [
                "None"
            ]
        }, 
        "cmip6.land.carbon_cycle.vegetation.photosynthesis.method": {
            "values": [
                "Photosynthesis in C3 plants is based on Farquhar model.  C4 photosynthesis is based on Collatz.  The implementation is described in Bonan et al. (2011).  Photosynthetic capacity (Vcmax25 and Jmax25) is predicted by a mechanistic model of leaf utilization of nitrogen for assimilation (LUNA), which is based on an optimality hypothesis for nitrgoen allocation among light capture, electron transport, carboxylation, respiration and storage.  Specifically, the model allocates the nitrogen by maximizing the daily net photosynthetic carbon gain under following two key assumptions: nitrogen allocated for light capture, electron transport and carboxylation are co-limiting; respiratory nitrogen is allocated to maintain dark respiration determined by Vcmax.  Temperature acclimation of photosynthesis is also accounted for.\nA full description of photosynthesis and photosynthetic capacity is available in the CLM5 Tech Description (https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Photosynthesis/CLM50_Tech_Note_Photosynthesis.html, https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Photosynthetic_Capacity/CLM50_Tech_Note_Photosynthetic_Capacity.html)   "
            ]
        }, 
        "cmip6.land.carbon_cycle.vegetation.autotrophic_respiration.maintainance_respiration": {
            "values": [
                "The Atkin et al. (2016) model for leaf respiration is used.  This model is based on the leaf nitrogen content per unit area ( (gN m 2 leaf), with an intercept parameter that is PFT dependent, and an acclimation term that depends upon the average temperature of the previous 10 day period.  Maintenance respiration for woody biomass is calculated via a Q10 function.  Note that, for woody vegetation, maintenance respiration costs are not calculated for the dead stem and dead coarse root components. These components are assumed to consist of dead xylem cells, with no metabolic function. By separating the small live component of the woody tissue (ray parenchyma, phloem, and sheathing lateral meristem cells) from the larger fraction of dead woody tissue, it is reasonable to assume a common base maintenance respiration rate for all live tissue types.  https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Plant_Respiration/CLM50_Tech_Note_Plant_Respiration.html#maintenance-respiration"
            ]
        }, 
        "cmip6.land.carbon_cycle.vegetation.autotrophic_respiration.growth_respiration": {
            "values": [
                "Growth respiration is calculated as a factor of 0.11 times the total carbon allocation to new growth after allocating carbon for N acquisition. https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Plant_Respiration/CLM50_Tech_Note_Plant_Respiration.html#growth-respiration"
            ]
        }, 
        "cmip6.land.carbon_cycle.vegetation.allocation.method": {
            "values": [
                "Fixed carbon allocation dependent on PFT.  Leaf nitrogen allocation is flexible.  "
            ]
        }, 
        "cmip6.land.carbon_cycle.vegetation.allocation.allocation_bins": {
            "values": [
                "Leaves + fine roots + coarse roots + stems"
            ]
        }, 
        "cmip6.land.carbon_cycle.vegetation.allocation.allocation_fractions": {
            "values": [
                "Function of vegetation type"
            ]
        }, 
        "cmip6.land.carbon_cycle.vegetation.phenology.method": {
            "values": [
                "The CLM phenology model consists of several algorithms controlling the transfer of stored carbon and nitrogen out of storage pools for the display of new growth and into litter pools for losses of displayed growth. PFTs are classified into three distinct phenological types that are represented by separate algorithms: an evergreen type, for which some fraction of annual leaf growth persists in the displayed pool for longer than one year; a seasonal-deciduous type with a single growing season per year, controlled mainly by temperature and daylength; and a stress-deciduous type with the potential for multiple growing seasons per year, controlled by temperature and soil moisture conditions. The three phenology types share a common set of control variables. The calculation of the phenology fluxes is generalized, operating identically for all three phenology types, given a specification of the common control variables.\nhttps://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Vegetation_Phenology_Turnover/CLM50_Tech_Note_Vegetation_Phenology_Turnover.html\n\nThe crop model uses the AgroIBIS crop phenology algorithm (Kucharik and Brye 2003), consisting of three distinct phases. Phase 1 starts at planting and ends with leaf emergence, phase 2 continues from leaf emergence to the beginning of grain fill, and phase 3 starts from the beginning of grain fill and ends with physiological maturity and harvest.\nhttps://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Crop_Irrigation/CLM50_Tech_Note_Crop_Irrigation.html"
            ]
        }, 
        "cmip6.land.carbon_cycle.vegetation.mortality.method": {
            "values": [
                "Whole-plant mortality is parameterized very simply, assuming a mortality rate of 2% yr-1 for all vegetation types.  This is intended to represent the death of individuals from a stand of plants due to the aggregate of processes such as wind throw, insect attack, disease, extreme temperatures or drought, and age-related decline in vigor. These processes are referred to in aggregate as “gap-phase” mortality. Mortality due to fire and anthropogenic land cover change are treated separately."
            ]
        }, 
        "cmip6.land.carbon_cycle.litter.number_of_carbon_pools": {
            "values": [
                4
            ]
        }, 
        "cmip6.land.carbon_cycle.litter.carbon_pools": {
            "values": [
                "Coarse woody debris, 3 litter pools"
            ]
        }, 
        "cmip6.land.carbon_cycle.litter.decomposition": {
            "values": [
                "Vertically-resolved Century-based first-order decay "
            ]
        }, 
        "cmip6.land.carbon_cycle.litter.method": {
            "values": [
                "The Century-based decomposition cascade is a first-order decay model with parameters for base rate turnover times and respired fractions for each pool.  Carbon pools and decomposition are vertically-resolved.  Environmental modifiers that alter the base turnover rates include temperature, soil moisture, and oxygen concentration for each soil layer, and depth.  Decomposition rates can also be limited by availability of mineral nitrogen.  https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Decomposition/CLM50_Tech_Note_Decomposition.html"
            ]
        }, 
        "cmip6.land.carbon_cycle.soil.number_of_carbon_pools": {
            "values": [
                3
            ]
        }, 
        "cmip6.land.carbon_cycle.soil.carbon_pools": {
            "values": [
                "soil1c, soil2c, soil3c"
            ]
        }, 
        "cmip6.land.carbon_cycle.soil.decomposition": {
            "values": [
                "Vertically-resolved Century-based first-order decay"
            ]
        }, 
        "cmip6.land.carbon_cycle.soil.method": {
            "values": [
                "The Century-based decomposition cascade is a first-order decay model with parameters for base rate turnover times and respired fractions for  each pool.  Carbon pools and decomposition are vertically-resolved.  Environmental modifiers that alter the base turnover rates include temperature, soil moisture, and oxygen concentration for each soil layer, and depth.  Decomposition rates can also be limited by \navailability of mineral nitrogen.  \nhttps://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Decomposition/CLM50_Tech_Note_Decomposition.html"
            ]
        }, 
        "cmip6.land.carbon_cycle.permafrost_carbon.is_permafrost_included": {
            "values": [
                true
            ]
        }, 
        "cmip6.land.carbon_cycle.permafrost_carbon.emitted_greenhouse_gases": {
            "values": [
                "CO2, CH4"
            ]
        }, 
        "cmip6.land.carbon_cycle.permafrost_carbon.decomposition": {
            "values": [
                "Vertically-resolved Century-based first-order decay"
            ]
        }, 
        "cmip6.land.carbon_cycle.permafrost_carbon.impact_on_soil_properties": {
            "values": [
                "Soil thermal and hydrologic properties depend on water content and phase.  An ice impedance function is used that strongly impedes liquid water flow through icy soil.  Organic fraction in each soil layer, which also affects thermal and hydrologic soil properties, are specified from a dataset and are constant through time, even if prognostic soil carbon stocks change.  "
            ]
        }, 
        "cmip6.land.nitrogen_cycle.overview": {
            "values": [
                "The representation of the nitrogen cycle in CLM5, originally based on Biome-BGC, is substantially modified relative to CLM4 and CLM4.5. First, recognizing that leaf nitrogen content is dynamic, implementation of  “FlexCN” functionality affords flexible plant stoichiometry and thus a single realized GPP calculation (as opposed to separate potential and actual fluxes). Second, recognizing that foliar photosynthetic capacity responds to environmental conditions and changes over space and time, the Leaf Utilization of Nitrogen for Assimilation (LUNA) module provides a prognostic optimization of maximum leaf-level carboxylation and electron transport rates.  Third, recognizing that changes in nitrogen supply or demand have consequences for plant productivity, the Fixation and Uptake of Nitrogen (FUN) module calculates the carbon costs of various nitrogen acquisition strategies and adjusts carbon expenditure on N uptake among biological fixation, active uptake, and retranslocation. Note, as currently implemented the plant C costs calculated by FUN only serve as an additional source of autotrophic respiration, not as an actual belowground C flux to roots or mycorrhizae that interacts with the soil biogeochemistry simulated in CLM5. Collectively, FlexCN, LUNA, and FUN more mechanistically represent plant nitrogen dynamics in CLM5 and afford opportunities to understand, refine, and improve simulated C-N biogeochemical dynamics.   Competition between plant and microbial nitrogen demand can be resolved. Mineral nitrogen in the soil pool at the beginning of the timestep is considered the available supply. The theoretical maximum demand for nitrogen by plants to meet the entire carbon uptake given an N cost of zero (and therefore represents the upper bound on N requirements). N uptake costs that are > 0 imply that the plant will take up less N that it demands, ultimately.  However, given the heuristic nature of the N competition algorithm, this discrepancy is not explicitly resolved here.  Soil carbon decomposition rates can be limited by the availability of  mineral nitrogen, but calculation of this limitation depends on first estimating the potential rates of decomposition, assuming an unlimited  mineral nitrogen supply.  Asymbiotic (or free living) N fixation is a function of evapotranspiration and is added to the inorganic nitrogen (NH4+) pool. Symbiotic N fixation is handled by the FUN model and is passed straight to the plant, not the mineral nitrogen pool.  Fertilizer is added to crops during the emergence phase.  See Sections 2.16, 2.18, 2.19, 2.21, 2.22, and 2.26 of the Technical Description for more details.  https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/index.html"
            ]
        }, 
        "cmip6.land.nitrogen_cycle.tiling": {
            "values": [
                "Same as carbon tiling.  Industrial fertilizer is applied from dataset on crop columns."
            ]
        }, 
        "cmip6.land.nitrogen_cycle.time_step": {
            "values": [
                3600
            ]
        }, 
        "cmip6.land.nitrogen_cycle.prognostic_variables": {
            "values": [
                "Nitrogen variables mirror carbon variables."
            ]
        }, 
        "cmip6.land.river_routing.name": {
            "values": [
                "Model for Scale Adaptive River Transport (MOSART)"
            ]
        }, 
        "cmip6.land.river_routing.overview": {
            "values": [
                "MOSART divides each spatial unit into three categories of hydrologic units: hillslopes that convert both surface and subsurface runoff into tributaries, tributaries that discharge into a single main channel, and the main channel that connects the local spatial unit with upstream/downstream units through the river network. MOSART assumes that all the tributaries within a spatial unit can be treated as a single hypothetical sub-network channel with a transport capacity equivalent to all the tributaries combined. Correspondingly, three routing processes are represented in MOSART: 1) hillslope routing: in each spatial unit, surface runoff is routed as overland flow into the sub-network channel, while subsurface runoff generated in the spatial unit directly enters the sub-network channel; 2) sub-network channel routing: the sub-network channel receives water from the hillslopes, routes water through the channel and discharges it into the main channel; 3) main channel routing: the main channel receives water from the sub-network channel and/or inflow, if any, from the upstream spatial units, and discharges the water to its downstream spatial unit or the ocean.  In MOSART, the travel velocities of water across hillslopes, sub-network and main channel are all estimated using Manning’s equation. https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/MOSART/CLM50_Tech_Note_MOSART.html"
            ]
        }, 
        "cmip6.land.river_routing.time_step": {
            "values": [
                3600
            ]
        }, 
        "cmip6.land.river_routing.grid_inherited_from_land_surface": {
            "values": [
                false
            ]
        }, 
        "cmip6.land.river_routing.grid_description": {
            "values": [
                "0.5degree resolution directional file.  The baseline high-resolution hydrography dataset is the 1km resolution Hydrological data and maps based on SHuttle Elevation\nDerivatives at multiple Scales (HydroSHEDS)"
            ]
        }, 
        "cmip6.land.river_routing.number_of_reservoirs": {
            "values": [
                0
            ]
        }, 
        "cmip6.land.river_routing.water_re_evaporation": {
            "values": [
                "Irrigation"
            ]
        }, 
        "cmip6.land.river_routing.coupled_to_atmosphere": {
            "values": [
                false
            ]
        }, 
        "cmip6.land.river_routing.coupled_to_land": {
            "values": [
                "Surface runoff is routed as overland flow into the sub-network channel, while subsurface runoff generated in the spatial unit directly enters the sub-network channel. Coupling in the CMIP configuration of the model is assumed to be one-way (i.e., only gaining streams/rivers are considered)."
            ]
        }, 
        "cmip6.land.river_routing.basin_flow_direction_map": {
            "values": [
                "Present day"
            ]
        }, 
        "cmip6.land.river_routing.flooding": {
            "values": [
                "Flooding is not enabled in CMIP simulations."
            ]
        }, 
        "cmip6.land.river_routing.prognostic_variables": {
            "values": [
                "river flow "
            ]
        }, 
        "cmip6.land.river_routing.oceanic_discharge.discharge_type": {
            "values": [
                "Other: document in cell to the right"
            ]
        }, 
        "cmip6.land.river_routing.oceanic_discharge.quantities_transported": {
            "values": [
                "Water"
            ]
        }, 
        "cmip6.land.lakes.overview": {
            "values": [
                "The lake model solves the 1D thermal diffusion equation by dividing the lake vertical profile into several discrete layers corresponding to: snow (when snow is present and greater than a minimum thickness); lake liquid water and ice (referred to collectively as the “lake body”); and underlying substrates (sediment, soil, and bedrock; hereafter referred to collectively as “sediment” except where otherwise noted). Sensible heat, latent heat, momentum, and radiation fluxes are calculated between the surface and the lower atmosphere (i.e., an observation height or atmospheric model bottom level). The residual energy flux at the surface is then used as a top boundary condition for thermal diffusion in the snow, lake body, and sediment. Constant lake body water content and saturated sediments are assumed, although the snow depth and properties are prognosed. In the lake body, mixing is caused by wind‐driven eddies, convection, molecular diffusion, and unresolved 3D mixing processes. Shortwave (i.e., solar visible and near‐infrared (NIR)) radiation is  distributed among the snow and lake body according to their diagnosed  optical properties. https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Lake/CLM50_Tech_Note_Lake.html"
            ]
        }, 
        "cmip6.land.lakes.coupling_with_rivers": {
            "values": [
                false
            ]
        }, 
        "cmip6.land.lakes.time_step": {
            "values": [
                3600
            ]
        }, 
        "cmip6.land.lakes.vertical_grid": {
            "values": [
                "25-layer increasing thickness with depth, 0.1m thick surface layer"
            ]
        }, 
        "cmip6.land.lakes.prognostic_variables": {
            "values": [
                "temperature, evaporation, albedo, ice fraction, snow, surface energy balance"
            ]
        }, 
        "cmip6.land.lakes.method.ice_treatment": {
            "values": [
                true
            ]
        }, 
        "cmip6.land.lakes.method.albedo": {
            "values": [
                "Prognostic"
            ]
        }, 
        "cmip6.land.lakes.method.dynamics": {
            "values": [
                "Vertical"
            ]
        }, 
        "cmip6.land.lakes.method.dynamic_lake_extent": {
            "values": [
                false
            ]
        }, 
        "cmip6.land.lakes.method.endorheic_basins": {
            "values": [
                true
            ]
        }, 
        "cmip6.land.lakes.wetlands.description": {
            "values": [
                "Wetlands not explicitly treated.  Saturated area within natural vegetation landunit is diagnosed for purpose of methane emissions model (https://escomp.github.io/ctsm-docs/doc/build/html/tech_note/Methane/CLM50_Tech_Note_Methane.html#inundated-fraction-prediction).  Ephemeral surface water and resulting impact of surface water on ET and energy balance also calculated."
            ]
        }
    }
}